'''Введение в интерпретатор Python.
 Python - это не только язык программирования, но и в текущей реализации это еще и программный пакет,
который называется интерпретатором. Интерпретатор – это такой модуль, который исполняет другие программы.
Когда вы пишете код на языке Python, интерпретатор Python читает вашу программу и выполняет составляющие ее инструкции.
По сути дела интерпретатор – это слой программной логики между вашим программным кодом и аппаратурой вашего компьютера.
Всё понятно?'''
 
