''' 
----Глава 1. Как Python запускает программы
      1.1 Введение в интерпретатор Python
      1.2 Выполнение программы
      1.3 Разновидности модели выполнения
      1.4 В заключение
      1.5 Закрепление пройденного
----Глава 2. Как пользователь запускает программы
      2.1 Интерактивный режим
      2.2 Системная командная строка и файлы
      2.3 Щелчок на ярлыке файла
      2.4 Импортирование и перезагрузка модулей
      2.5 Запуск модулей с помощью функции exec
      2.6 Пользовательский интерфейс IDLE102
      2.7 Другие интегрированные среды разработки
      2.8 Другие способы запуска
      2.9 Какие способы следует использовать?
      2.10 В заключение
      2.11 Закрепление пройденного
----Глава 3. Введение в типы объектов языка Python
      3.1 Зачем нужны встроенные типы?
      3.2 Числа
      3.3 Строки
      3.4 Списки
      3.5 Словари
      3.6 Кортежи
      3.7 Файлы
      3.8 Другие базовые типы
      3.9 В заключение
      3.10 Закрепление пройденного
----Глава 4. Числа
      4.1 Базовые числовые типы
      4.2 Числа в действии
      4.3 Другие числовые типы
      4.4 Числовые расширения
      4.5 В заключение
      4.6 Закрепление пройденного
----Глава 5. Интерлюдия о динамической типизации
      5.1 Отсутствие инструкций объявления
      5.2 Разделяемые ссылки
      5.3 Динамическая типизация повсюду
      5.4 В заключение
      5.5 Закрепление пройденного
      5.6 Ответы
----Глава 6. Строки
      6.1 Литералы строк
      6.2 Строки в действии
      6.3 Строковые методы
      6.4 Выражения форматирования строк
      6.5 Метод форматирования строк
      6.6 Общие категории типов
      6.7 В заключение
      6.8 Закрепление пройденного
----Глава 7. Списки и словари
      7.1 Списки
      7.2 Списки в действии
      7.3 Словари
      7.4 Словари в действии
      7.5 В заключение
      7.6 Закрепление пройденного
----Глава 8. Кортежи, файлы и все остальное
      8.1 Кортежи
      8.2 Кортежи в действии
      8.3 Файлы
      8.4 Пересмотренный перечень категорий типов
      8.5 Гибкость объектов
      8.6 Ссылки и копии
      8.7 Сравнивание, равенство и истина
      8.8 Иерархии типов данных в языке Python
      8.9 Другие типы в Python
      8.10 Ловушки встроенных типов
      8.11 В заключение
      8.12 Закрепление пройденного
----Глава 9. Введение в инструкции языка Python
      9.1 Структура программы на языке Python
      9.2 История о двух if
      9.3 Короткий пример: интерактивные циклы
      9.4 В заключение
      9.5 Закрепление пройденного
----Глава 10. Присваивание, выражения и print
      10.1 Инструкции присваивания
      10.2 Инструкции выражений
      10.3 Операция print
      10.4 В заключение
      10.5 Закрепление пройденного
----Глава 11. Условная инструкция if и синтаксические правила
      11.1 Условные инструкции if
      11.2 Синтаксические правила языка Python
      11.3 Проверка истинности
      11.4 Трехместное выражение if/else
      11.5 В заключение
      11.6 Закрепление пройденного
----Глава 12. Циклы while и for
      12.1 Циклы while
      12.2 break, continue, pass и else
      12.3 Циклы for
      12.4 Приемы программирования циклов
      12.5 В заключение
      12.6 Закрепление пройденного
----Глава 13. Итерации и генераторы, часть 1
      13.1 Итераторы: первое знакомство
      13.2 Генераторы списков: первое знакомство
      13.3 Новые итерируемые объекты в Python 3.0
      13.4 Другие темы, связанные с итераторами
      13.5 В заключение
      13.6 Закрепление пройденного
----Глава 14. Документация
      14.1 Источники документации в языке Python
      14.2 Типичные ошибки программирования
      14.3 В заключение
      14.4 Закрепление пройденного
----Глава 15. Основы функций
      15.1 Зачем нужны функции?
      15.2 Создание функций
      15.3 Первый пример: определения и вызовы
      15.4 Второй пример: пересечение последовательностей
      15.5 В заключение
      15.6 Закрепление пройденного
----Глава 16. Области видимости
      16.1 Области видимости в языке Python
      16.2 Инструкция global'''




